{
  "format": "simpletext",
  "formatVersion": 1,
  "name": "Hexagonal Pillar Chamber",
  "content": {
    "shortDesc": "You are standing in a cavern whose walls, floor, and ceiling are made of hexagonal rock pillars, with everything lit by electric lamps. There are three exits here: one at floor level, and two reachable by climbing a rough stairway of pillars.",
    "edges": {
      "0": {
        "leaveDesc": "You enter the tunnel at floor level. The bright light makes it easy to see where you're going as you navigate the uneven pillar floor of the tunnel. You have to duck now and then as the ceiling pillars are sometimes quite low. The tunnel curves to the right and begins to descend, and then the igneous rock pillars abruptly transition into a sedimentary slate. The string of lights also ends here, and soon there is very little light.",
        "enterDesc": "After you continue for a ways in near-darkness, the tunnel begins to become lighter again. You approach the brighter area, and find an electric cable with regular lightbulbs attached to the wall of the tunnel, which has also suddenly changed to a curiously hexagonal igneous rock from the earlier sedimentary slate. You carefully make your way down this tunnel, avoiding bumping your head on low-hanging rocks, until you emerge into a large underground room."
      },
      "1": {
        "leaveDesc": "You climb the rough stairway about halfway, and duck into the dark opening between the wall pillars. It is very tight and dark, and you soon find yourself crawling along the steeply upward-sloping tunnel by feel.",
        "enterDesc": "Carefully crawling down the tight, dark tunnel, you descend further amid the hexagonal pillars of rock. Eventually you emerge into a large, bright underground room and make your way down a rough stairway to the chamber floor."
      },
      "2": {
        "leaveDesc": "You climb all the way up the rough stairway, taking care not to fall to the floor a good way below you. The pillar stairs essentially continue into the ceiling, and you continue climbing without interruption. The cable of lights continues along the wall to your left, lighting the hexagonal pillar walls as you ascend.",
        "enterDesc": "You descend the steep staircase of hexagonal rock pillars, the lights to your right ensuring you don't stumble. You soon emerge down through the ceiling of a large chamber, and the rough stairway continues, curving to your left along the wall of the chamber, until you reach the floor."
      }
    },
    "targets": {
      "0": [""],
      "1": ["here", "area", "room", "chamber", "cavern"],
      "2": ["walls", "wall", "floor", "ceiling", "pillar", "pillars", "rocks", "igneous rocks", "rock pillars", "hexagonal pillars", "hexagonal rocks"],
      "3": ["stair", "stairway", "stairs"],
      "4": ["tunnel"],
      "5": ["floor tunnel"],
      "6": ["wall tunnel", "ten o'clock tunnel"],
      "7": ["ceiling tunnel", "three o'clock tunnel"],
      "8": ["lights", "electric lights"],
      "9": ["wire", "cable", "electrical wire"],
      "10": ["air"]
    },
    "results": {
      "0": "You stand in the middle of a roughly circular underground chamber about ten paces across, composed entirely of hexagonal pillars of some type of igneous rock, each about one pace in diameter. The pillars that make up the walls are all joined together and stretch from floor to ceiling, a height of around eight times yours. The floor and ceiling themselves are composed of the uneven, jagged stumps of these pillars, seeming to have been broken off. A series of these broken floor pillars gets higher and higher along the wall to your left, forming a very crude stairway. There are two openings amid the wall pillars there, one midway up the stairway at about your ten o'clock position, and another right up next to the roof, at about three o'clock. Behind where you stand on one of the pillar stumps, another tunnel opens into the wall at floor level. Everything is lit by several electric lights suspended from a cable running out of the upper tunnel entrance, down the wall next to the staircase, and reaching into the tunnel behind you.",
      "1": "The hexagonal pillars composing every natural surface in the room are made of a fine-grained basaltic rock of igneous origin. The flat vertical faces of the tightly-connected pillars give the walls a striped, faceted appearance, stark in the electric lighting. The rough ends of the pillars forming the floor and ceiling are uneven, with some sticking up past the others, making walking in the chamber difficult. Small gravel of the same rock is present, but the absence of larger chunks indicates that this room was not carved by a natural process. The air is very still and slightly stuffy.",
      "2": "The uneven floor pillars begin to rise just to your left, creating steps about as wide as you are tall, and each coming up to about your knee, wrapping around the curve of the chamber wall and reaching to the ceiling by the time they have covered about two thirds of the wall.",
      "3": "Do you mean the floor tunnel, the wall tunnel, or the ceiling tunnel?",
      "4":  "Several of the pillars are missing in the wall behind you, creating an opening just about as tall as you are, through which the electric lights can be seen receding into the well-lit distance.",
      "5": "A few pillars are missing about midway up the stairway, creating a dark opening with the wire of electric lights passing along the wall above it.",
      "6": "Through a hole perhaps five paces across in the wall and ceiling of this chamber, the stairway essentially seems to continue up into the ceiling high above you to your right. The cable of electric lights emerges from there.",
      "7": "A black-rubber-insulated cable about as thick as your pinky finger has been tacked along the wall with iron spikes. Brass-caged LED lightbulbs are connected perhaps every four paces, and emit a harsh white light.",
      "8": "There is a very faint electrical hum from the lights, but apart from that and your breathing, this chamber is dead silent.",
      "9": "edge0",
      "10": "edge1",
      "11": "edge2",
      "12": "It smells stuffy and somewhat dusty.",
      "13": "Would you like to go to the wall or the ceiling tunnel?",
      "14": "Apart from the rough stairway, the walls are quite sheer."
    },
    "bindings": {
      "0": {
        "0": "0",
        "1": "0",
        "2": "1",
        "3": "2",
        "4": "3",
        "5": "4",
        "6": "5",
        "7": "6",
        "8": "7",
        "9": "7"
      },
      "1": {
        "0": "8",
        "1": "8",
        "8": "8"
      },
      "2": {
        "10": "12"
      },
      "5": {
        "4": "3",
        "5": "9",
        "6": "10",
        "7": "11"
      },
      "6": {
        "4": "3",
        "5": "9",
        "6": "10",
        "7": "11"
      },
      "7": {
        "3": "13"
      },
      "10": {
        "2": "14",
        "3": "13"
      }
    }
  }
}
